zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
/********************************************************************************
* Include																		*
********************************************************************************/
#include "stm8s.h"
#include "Global_config.h"
#include "Module_Driver_Define.h"
#include "Module_Flash_Information.h"
#include "Module_Variable_Define.h"
#include "Module_Var_Bit_Define.h"

/********************************************************************************
* Define																		*
********************************************************************************/

/********************************************************************************
* Extern Function																*
********************************************************************************/


/********************************************************************************
* Extern Variable																*
********************************************************************************/

/********************************************************************************
* Global Variable																*
********************************************************************************/


//////////////////////////////////////////////////////////////////////////////
unsigned int FirstInitial_Func(){
	
	System_clk_setup();
	InitLEDDisplay();

//    SetLedOnOff(LED1, TurnOn);
//    SetLedOnOff(LED2, TurnOn);
//    SetLedOnOff(LED3, TurnOn);
//    SetLedOnOff(LED4, TurnOn);
//    SetLedOnOff(LED5, TurnOn);

	// Initialize LEDs
	//InitLEDPort(); 
	//InitBlinkLEDs();
	
	//Setup_USI_Slave();
	
	
	delay_cycles(10);	//200us at 4MHz
	delay_cycles(20);	//400us at 4MHz
	delay_cycles(30);	//600us at 4MHz
	delay_cycles(40);	//800us at 4MHz
	delay_cycles(50);	//1ms at 4MHz
	
	
  return StartUp;
}


unsigned int Startup_Func()
{
  
	//Initialization
	disableInterrupts();  /* disable interrupts */
	//_DINT();
	// Initialize LEDs
	//InitLEDPort();
	//InitBlinkLEDs();
	
	G_Module_Status = 0;
    G_Auxiliary_Module_Status = 0;
	G_SystemFailureStatus = 0;
    G_Device_Interface_Status1 = 0;
    G_Add_Device_Interface_Status = 0;
	
	
//	LED_test_init();
//	//tim4_init();
//	tim3_init();
//	
//	button_init();
//	uart_init();
//    adc_init();
	
	delay_cycles(50);	//1ms at 4MHz
	delay_cycles(50);	//1ms at 4MHz
	delay_cycles(50);	//1ms at 4MHz
 
  
  
	//Setup_USI_Slave();
	//InitTimerA();
	//InitButton();
	//Enable_SW_Interrupt(true);
	
	//InitAdcReader();
	//InitInputSignalGetting();
	//InitMosControl();
	
	//_EINT();
	//enableInterrupts();  /* enable interrupts */
	
	//StartAdcConversion();
	

	//return ShippingMode;
	//InitCoulombCounter();
	
	//StartAdcConversion();  
	//MOSFET Fail Check
	//  if( GetADCValue(IDSG_ADC) > ADC_DETECT_CURRENT_OF_DSG_STATUS ||
	//      GetADCValue(ICHG_ADC) > ADC_DETECT_CURRENT_OF_CHG_STATUS ){
	//      G_uc_SystemFailureCode = MOSFETFail;
	//      setBlinkLED(SystemFailBlinkLED, true);
	//      return FailureMode;
	//    }
    
    InitTimerPollingVariables();
    
    InitButtonEvent();
    
    InitADCFunction();
    //Set_Interrupt_ADC_Conversion_Finish_Function(ProtectionForPolling);
    
    InitMosControl();
    InitAdapterOutputSignal();
    delay_cycles(5);

    
	enableInterrupts();  /* enable interrupts */
    
//    while(1){
//    SetLedPWMFunction(0x1f, TurnOn);
//    
//    unsigned int i,j;
//    unsigned int loop_d = 150;
//    unsigned int ddelay = 100;
//    for(i = 0; i< loop_d; i++){
//        delay_cycles(ddelay);
//    }
//    
//    for(j=0; j< 20; j++){
//        SetLedPWM20Steps(j);
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }
//    
//    SetLedPWMFunction(0x00, TurnOff);
//    
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }
    while(1){
      delay_cycles(5);  //about 90us at 4MHz
      delay_cycles(10); //about 132us at 4MHz
      delay_cycles(20); //about 224us at 4MHz
      delay_cycles(30); //about 318us at 4MHz
      delay_cycles(40); //about 410us at 4MHz
      delay_cycles(50); //about 502us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
      
      SetLedOnOff(LED2, TurnOn);
      startAdcConversion();
      SetLedOnOff(LED2, TurnOff);
    };
    
unsigned char temp = 0;
    if(temp == 0){
        SetLedOnOff(LED1, TurnOn);
    }else{
        SetLedOnOff(LED1, TurnOff);
    }
    temp ^= 0x01;
    
    return NormalMode;
}
unsigned int Normal_Func(){
    
    return ShutdownMode;
}

unsigned int Shutdown_Func(){
    
    return StartUp;
}
#if 0
unsigned int Normal_Func(){
  //////////////////////////////////////////////////////////////////////////////
  // 2012/05/07 Remove DOC Propection, hsinmo
  //unsigned int DSG_OC_Delay_Count;
  unsigned int CHG_OC_Delay_Count;
  unsigned int _2ND_OV_Delay_Count;
  unsigned int _2ND_UV_Delay_Count;
  unsigned int iTemp1, iTemp2;
  
  //DSG_OC_Delay_Count = 0;
  CHG_OC_Delay_Count = 0;
  _2ND_OV_Delay_Count = 0;
  _2ND_UV_Delay_Count = 0;
  
  setMosFET(MOSFET_CHG, DeviceOn);
  setMosFET(MOSFET_DSG, DeviceOn);


  //Clear Activate Action Flag
  G_Activate_Action_Status = 0;
  G_Activate_Action_Status_Other1  = 0;
  //G_CHG_CV_MODE_Cycle_Count = 0;
  //G_DSG_CHG_OC_Delay_Count = 0;
  
  //Coulomb Counter Start
  G_Activate_Action_Status |= ACCUMULATING_Q_ENABLE;
  
  while(1){

    
    __delay_cycles(3000);  // 3ms ==> 1MHz clock
    StartAdcConversion();
    
    ///////////////////////////////////////
    // Current Detection
    iTemp1 = GetADCValue(ICHG_ADC);
    iTemp2 = GetADCValue(IDSG_ADC);
    if( iTemp1 >= ADC_DETECT_CURRENT_OF_CHG_STATUS){
      // in charging status
      G_Module_Status &= ~Module_DSG;
      G_Module_Status &= ~Module_RELAX;
    }else if( iTemp2 < ADC_DETECT_CURRENT_OF_DSG_STATUS ){
      // in relaxation mode or Quiescent current
      G_Module_Status |= Module_DSG;
      G_Module_Status |= Module_RELAX;
    }else{
      // in discharging
      G_Module_Status &= ~Module_RELAX;
      G_Module_Status |= Module_DSG;
    }
  
    
