zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
    if( iTemp1 >= ADC_COC_PROTECTION && ((G_Module_Status & Module_C_OC) == 0 )){
      CHG_OC_Delay_Count++;
      if(CHG_OC_Delay_Count >= OC_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_C_OC;
        //setBlinkLED(OC_BlinkLED, true);
      }
    }else{
      CHG_OC_Delay_Count = 0;
    }
//////////////////////////////////////////////////////////////////////////////
// 2012/05/07 Remove DOC Propection, hsinmo
//    if( iTemp2 >= ADC_DOC_PROTECTION && ((G_Module_Status & Module_D_OC) == 0 )){
//      G_DSG_CHG_OC_Delay_Count += (1 << 4);
//      if((G_DSG_CHG_OC_Delay_Count & 0xf0) >= (PROTECTION_DELAY_LOOP_COUNT << 4 )){
//        G_Module_Status |= Module_D_OC;
//        setBlinkLED(OC_BlinkLED, true);
//      }
//    }else{
//      G_DSG_CHG_OC_Delay_Count &= ~(0xf0);
//    }
    
    
    
    ///////////////////////////////////////
    //  Voltage control
    //Vbat Voltage check ==> 2nd level
    iTemp1 = GetADCValue(Vbat_ADC);
   
    if( iTemp1 > ADC_2ND_BATTERY_OV_PROTECTION &&
        (G_Module_Status & Module_2nd_OV) == 0)
    {
      _2ND_OV_Delay_Count++;
      if(_2ND_OV_Delay_Count >= OV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_OV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else if( iTemp1 < ADC_2ND_BATTERY_UV_PROTECTION && 
        (G_Module_Status & Module_2nd_UV) == 0)
    {
      _2ND_UV_Delay_Count++;
      if(_2ND_UV_Delay_Count >= UV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_UV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else{
      _2ND_UV_Delay_Count = 0;
      _2ND_OV_Delay_Count = 0;
    }
    
    //Cell OV/UV protection and release
    if(get_PIC_UVP_Status()){
      G_Module_Status |= Module_UV;
    }else{
      G_Module_Status &= ~Module_UV;
    }
    if(get_PIC_OVP_Status()){
      G_Module_Status |= Module_OV;
    }else{
      G_Module_Status &= ~Module_OV;
    }   
    

    ///////////////////////////////////////
    //Thermal protection
    iTemp1 = GetADCValue(T1_ADC);
    if( iTemp1 <= ADC_CHG_OT_PROTECTION){
      G_Module_Status |= Module_CHG_OT;
    }
    if( iTemp1 <= ADC_DSG_OT_PROTECTION){
      G_Module_Status |= Module_DSG_OT;
    }
    
    if( iTemp1 >= ADC_UT_PROTECTION){
      G_Module_Status |= Module_UT;
    }
    if(G_Module_Status & Module_DSG_OT ||
       G_Module_Status & Module_CHG_OT ||
       G_Module_Status & Module_UT  ||
       G_Module_Status & Module_OV  ||
       G_Module_Status & Module_UV){
      //setBlinkLED(OT_UT_BlinkLED, true);
//      setBlinkLED(OV_UV_BlinkLED, true);
    }else{
      //setBlinkLED(OT_UT_BlinkLED, false);
//      setBlinkLED(OV_UV_BlinkLED, false);
    }
    
    /////////////////////////////////////////////////////////
    // Check abnormal Flag
    /////////////////////////////////////////////////////////
//    if((G_Module_Status & Module_2nd_OV) && (G_Module_Status & Module_2nd_UV)) {
//      G_uc_SystemFailureCode = _2nd_Level_Vol_Fail;
//      return FailureMode;
//    }
    /////////////////////////////////////////////////////////
    //2012/05/21 remove Fail mode function, hsinmo
//    if((G_Module_Status & Module_RELAX) && ((G_Module_Status & Module_DSG)==0)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_C_OC) && (G_Module_Status & Module_D_OC)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_UV) && (G_Module_Status & Module_OV)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_DSG_OT) && (G_Module_Status & Module_UT)){
//      G_uc_SystemFailureCode = ThermalFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_CHG_OT) && (G_Module_Status & Module_UT)){
//      G_uc_SystemFailureCode = ThermalFail;
//      return FailureMode;
//    }
    
    /////////////////////////////////////////////////////////
    // Comparation protection and active function section
    /////////////////////////////////////////////////////////
    //check suspend mode
    if(G_Module_Status & Module_RELAX){
      G_Activate_Action_Status |= ENABLE_SUSPEND_COUNTER;
    }else{
      G_Activate_Action_Status &= ~ENABLE_SUSPEND_COUNTER;
      G_Activate_Action_Status &= ~SUSPEND_COUNTING_FINISH;
    }
    
    
    if(G_Module_Status & (Module_D_OC)){
//////////////////////////////////////////////////////////////////////////////
// 2012/05/07 Remove DOC Propection, hsinmo
//      setMosFET(MOSFET_CHG, DeviceOff);
//      setMosFET(MOSFET_DSG, DeviceOff);
//      if((G_Activate_Action_Status & ENABLE_OC_COUNTER)==0){
//        G_Activate_Action_Status |= ENABLE_OC_COUNTER;
//      }
//      //OC Release and clear Flag
//      if(G_Activate_Action_Status & OC_COUNTING_FINISH){
//        G_Activate_Action_Status &= ~ENABLE_OC_COUNTER;
//        G_Activate_Action_Status &= ~OC_COUNTING_FINISH;
//        OC_Timer_Counter = 0;
//        G_Module_Status &= ~Module_D_OC;
//        setMosFET(MOSFET_CHG, DeviceOn);
//        setMosFET(MOSFET_DSG, DeviceOn);
//        setBlinkLED(OC_BlinkLED, false);
//      }
    }else if(G_Module_Status & (Module_C_OC)){
      setMosFET(MOSFET_CHG, DeviceOff);
      setMosFET(MOSFET_DSG, DeviceOff);
      if((G_Activate_Action_Status & ENABLE_OC_COUNTER)==0){
        G_Activate_Action_Status |= ENABLE_OC_COUNTER;
      }
      //OC Release and clear Flag
      if(G_Activate_Action_Status & OC_COUNTING_FINISH){
        OC_Timer_Counter = 0;
        G_Activate_Action_Status &= ~ENABLE_OC_COUNTER;
        G_Activate_Action_Status &= ~OC_COUNTING_FINISH;
        G_Module_Status &= ~Module_C_OC;
        setMosFET(MOSFET_CHG, DeviceOn);
        setMosFET(MOSFET_DSG, DeviceOn);
        //setBlinkLED(OC_BlinkLED, false);
      }
    }else if(G_Module_Status & (Module_DSG_OT+ Module_CHG_OT + Module_UT)){
      
