zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
      iTemp1 = GetADCValue(T1_ADC);
      //////////////////////////////////////////////////////////////////////////////
      // 2012/05/08 Remove T2 temperature, hsinmo
      if(G_Module_Status & (Module_CHG_OT + Module_UT)){
        setMosFET(MOSFET_CHG, DeviceOff);
        if(G_Module_Status & Module_CHG_OT){
          if( iTemp1 > ADC_CHG_OT_RELEASE){
            G_Module_Status &= ~Module_CHG_OT;
          }
        }
        if(G_Module_Status & Module_UT){
          if( iTemp1 < ADC_UT_RELEASE){
            G_Module_Status &= ~Module_UT;
          }
        }
        if((G_Module_Status & (Module_CHG_OT + Module_UT))== 0){
          setMosFET(MOSFET_CHG, DeviceOn);
        }
        
      }//if(G_Module_Status & (Module_CHG_OT + Module_UT){
      if(G_Module_Status & Module_DSG_OT){
        setMosFET(MOSFET_DSG, DeviceOff);
        if(G_Module_Status & Module_DSG_OT){
          if( iTemp1 > ADC_DSG_OT_RELEASE){
            G_Module_Status &= ~Module_DSG_OT;
            setMosFET(MOSFET_DSG, DeviceOn);
          }
        }        
      }//if(G_Module_Status & (Module_DSG_OT){
      
    }else if(G_Module_Status & Module_2nd_OV){
        setMosFET(MOSFET_CHG, DeviceOff);
        //relese 2nd_OV
        iTemp1 = GetADCValue(Vbat_ADC);
        if( iTemp1 < ADC_2ND_BATTERY_OV_RELEASE){
          G_Module_Status &= ~Module_2nd_OV;
          setMosFET(MOSFET_CHG, DeviceOn);
        }
    }else if(G_Module_Status & Module_2nd_UV){
        
        /////////////////////////////////////////////////
        //remove by hsinmo 2012/05/23, because of retry pack voltage 
        //relese 2nd_UV By Release Voltage
        /////////////////////////////////////////////////
        //setMosFET(MOSFET_DSG, DeviceOff);
        //iTemp1 = GetADCValue(Vbat_ADC);
        //if( iTemp1 > ADC_2ND_BATTERY_UV_RELEASE){
        //  G_Module_Status &= ~Module_2nd_UV;
        //  setMosFET(MOSFET_DSG, DeviceOn);
        //}
      
        /////////////////////////////////////////////////
        //add by hsinmo 2012/05/23
        //relese 2nd_UV By Charger staus
        if((G_Module_Status & Module_DSG)==0){
          // CHG status
          G_Module_Status &= ~Module_2nd_UV;
          setMosFET(MOSFET_DSG, DeviceOn);
        }else{
          // DSG status
          setMosFET(MOSFET_DSG, DeviceOff);
        }
    }else{  //else #1 start
      
      setMosFET(MOSFET_DSG, DeviceOn);
      setMosFET(MOSFET_CHG, DeviceOn);
      ////////////////////////////////////////////////////////////////////////////
      // if charging status and voltage higher then ADC_CHG_CV_MODE_LIMIT_VOLTAGE
      // set CHG_CV_MODE_START flag
      ////////////////////////////////////////////////////////////////////////////
      if((G_Module_Status & Module_DSG)==0){
        //charging status
//        iTemp1 = GetADCValue(Vbat_ADC);
//        if(iTemp1 >= ADC_CHG_CV_MODE_LIMIT_VOLTAGE && ((G_Activate_Action_Status & CHG_CV_MODE_START) == 0)){
//          G_Activate_Action_Status |= CHG_CV_MODE_START;
//        }
//        if((G_Activate_Action_Status & CHG_CV_MODE_START) == 0){
//          setMosFET(MOSFET_CHG, DeviceOn);
//        }
//        setMosFET(MOSFET_DSG, DeviceOn);
      }else{
        //discharging and releax status
        ////////////////////////////////////////////////////////////////////////////
        // if CHG_CV_MODE_START be set then RELAX status not for discharging
        ////////////////////////////////////////////////////////////////////////////
//        if((G_Module_Status & Module_RELAX) && (G_Activate_Action_Status & CHG_CV_MODE_START)){
//          //Still in CV_MODE
//          //do nothing
//        }else{
//          // release CV_MODE COUNTER
//          G_Activate_Action_Status &= ~CHG_CV_MODE_START;
//          G_CHG_CV_MODE_Cycle_Count = 0;
//          G_Activate_Action_Status &= ~ENABLE_CV_MODE_COUNTER;
//          G_Activate_Action_Status &= ~CV_MODE_RELEASE_COUNTING_FINISH;
//          
//          setMosFET(MOSFET_CHG, DeviceOn);
//          setMosFET(MOSFET_DSG, DeviceOn);
//        }
      }
    } //else #1 end

    ////////////////////////////////////////////////////////////////////////////
    // CHG_CV_MODE_START Process
    ////////////////////////////////////////////////////////////////////////////
//    if((G_Activate_Action_Status & CHG_CV_MODE_START)&&(G_CHG_CV_MODE_Cycle_Count < CHG_CV_MODE_REPEATING_CYCLE)){
//      iTemp1 = GetADCValue(Vbat_ADC);
//      if((iTemp1 >= ADC_CHG_CV_MODE_LIMIT_VOLTAGE) && (G_Activate_Action_Status & ENABLE_CV_MODE_COUNTER) == 0){
//        setMosFET(MOSFET_CHG, DeviceOff);
//        G_CHG_CV_MODE_Cycle_Count++;
//        G_Activate_Action_Status |= ENABLE_CV_MODE_COUNTER;
//      }
//      /////////////////////////////////////////////////////
//      //Last cycle will not be into this section
//      // it's mean Last cycle Chg mos will be turned off
//      if(G_Activate_Action_Status & CV_MODE_RELEASE_COUNTING_FINISH){
//        setMosFET(MOSFET_CHG, DeviceOn);
//        G_Activate_Action_Status &= ~ENABLE_CV_MODE_COUNTER;
//        G_Activate_Action_Status &= ~CV_MODE_RELEASE_COUNTING_FINISH;
//        CHG_CV_MODE_Timer_Counter = 0;
//      }
//    }
//    
    
    
    
    ///////////////////////////////////////////////////////////////////////////////
    // Button Function
    ///////////////////////////////////////////////////////////////////////////////
    if(G_Activate_Action_Status & BUTTON_LONG_PRESS_FLAG){
      G_Activate_Action_Status = 0;
      G_Activate_Action_Status_Other1 = 0;
      G_Activate_Action_Status_Other1 |= LightOff_Seq_LED;
      return ShutdownMode;
    }
    if(G_Activate_Action_Status & BUTTON_CLICK_FLAG){
      G_Activate_Action_Status &= ~BUTTON_CLICK_FLAG;
      if((G_Module_Status & Module_DSG)==0){
        iTemp1 = ADC_LOOKUP_1st_OCV_CURRENT_RANGE - 2;//charger=2A ==>4p cell=0.1C
        //iTemp1 = GetADCValue(ICHG_ADC);
      }else{
        iTemp1 = GetADCValue(IDSG_ADC);
      }
      iTemp2 = GetADCValue(Vbat_ADC);
      DisplayCapacity(getRealCapacityByCell(iTemp2,iTemp1), true);
    }
    
